DataProcessors/ЗагрузкаПрейскуранта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаПрейскуранта</Name>
			<Comment>vvv</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФайлЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПо</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Прейскурант</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обоснование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолЧеловек</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаработнаяПлатаОсновная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаработнаяПлатаДополнительная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СведенияОВидахРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>СведенияОВидахРабот</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьПоПрейскуранту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаработнаяПлатаОсновная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаработнаяПлатаДополнительная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормативЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасчетСдельныхРасценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаПрейскуранта/Ext/ObjectModule.bsl
//**********************************************************************************
Процедура ВыборФайлаДляЗагрузки(Элемент) Экспорт
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогФыбораФайла.Фильтр                      = "(*.xls)|*.xls";
	ДиалогФыбораФайла.Заголовок                   = "Выберите файл для загрузки данных";
	ДиалогФыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогФыбораФайла.Расширение                  = "xls";
	ДиалогФыбораФайла.ИндексФильтра               = 0;
	ДиалогФыбораФайла.ПолноеИмяФайла              = Элемент.Значение;
	ДиалогФыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Элемент.Значение = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры
//**********************************************************************************
Процедура ЗагрузитьПрейскурант() Экспорт
	
	Окно=новый COMОбъект("Excel.Application");
	Книга=окно.Workbooks; 
	Книга1=Книга.open(СокрЛП(Файлзагрузки));  
	
	Для л=1 По Книга1.Sheets.Count Цикл
		
		 Лист=Книга1.Sheets(л);
		 
		 Если Найти(Лист.Name,"Прейскурант")=1  тогда
		 		 
			Если (Лист.Range("A2").Value="Код") И (Лист.Range("B2").Value="Наименование") 				 
				И (Лист.Range("C2").Value="Ед.изм.")
				И (Лист.Range("D2").Value="Цена без НДС")
				И (Лист.Range("E2").Value="Норма времени") Тогда						
				
				ном=3;
				Для ном = 3 по 1600 Цикл				
					Если ЗначениеЗаполнено(Лист.Cells(ном,1).Value) тогда											
						НоваяСтрока=Прейскурант.Добавить();  												
						НоваяСтрока.Группа=Лист.Name;						
						НоваяСтрока.Код=СокрЛП(Лист.Cells(ном,1).Value);
						НоваяСтрока.Наименование=Лист.Cells(ном,2).Value;
						НоваяСтрока.ЕдИзм=Лист.Cells(ном,3).Value;
						НоваяСтрока.ДатаС=Лист.Range("E1").Value;
						НоваяСтрока.Стоимость=Лист.Cells(ном,4).Value;
						НоваяСтрока.НормаВремени=Лист.Cells(ном,5).Value;
						НоваяСтрока.КолЧеловек=Лист.Cells(ном,6).Value;
						НоваяСтрока.ЗаработнаяПлатаОсновная=Лист.Cells(ном,7).Value;
						НоваяСтрока.ЗаработнаяПлатаДополнительная=Лист.Cells(ном,8).Value;
						Если (ЗначениеЗаполнено(НоваяСтрока.ЕдИзм)) или (ЗначениеЗаполнено(НоваяСтрока.Стоимость)) тогда 
							Поз_=Найти(НоваяСтрока.Код,"-");
							ПозТчк=Найти(НоваяСтрока.Код,".");
							Если Поз_=0 тогда
								Сообщить("Неправильный код "+НоваяСтрока.Код);
							КонецЕсли; 
							НоваяСтрока.Обоснование="Прейск.№"+Лев(НоваяСтрока.Код,Поз_-1)+", п."+Прав(НоваяСтрока.Код,СтрДлина(НоваяСтрока.Код)-Поз_);
							НоваяСтрока.Обоснование=СтрЗаменить(НоваяСтрока.Обоснование,".0",".");
						КонецЕсли;	
					КонецЕсли;
					Состояние("Обрабатывается строка "+Строка(ном));
				КонецЦикла;
	
		    Иначе
				Сообщить("У Вас неизвестные данные на листе "+Лист.Name+" указанного XLS файла!");   
			КонецЕсли;			
		 КонецЕсли;		 
		
		
	КонецЦикла;   
	 
	Книга.Close();
	
	Попытка
		Окно.Application.Quit();
	Исключение
	КонецПопытки;
	
КонецПроцедуры
//**********************************************************************************
Процедура СоздатьРодителя(КодРодителя,Родитель)
	
	НайденныйРодитель=Справочники.ВидыРабот.НайтиПоРеквизиту("КодПоПрейскуранту",КодРодителя);
	
	Если НайденныйРодитель.Пустая() ТОгда
		НайденныйРодитель=Справочники.ВидыРабот.СоздатьГруппу();
		НайденныйРодитель.КодПоПрейскуранту=КодРодителя;
		НайденныйРодитель.Родитель=Родитель;
		НайденныйРодитель.Записать();
	КонецЕсли;	
	
	Родитель=НайденныйРодитель.Ссылка;
	
КонецПроцедуры
//**********************************************************************************
Функция РазложитьНаКоды(Код)
	
	СписокКодов=Новый СписокЗначений;
	
	ПозицияД=Найти(Код,"-");
	Если ПозицияД<>0 ТОгда
		СписокКодов.Добавить(ПреобразоватьНомерПрейскуранта(Лев(Код,ПозицияД-1)));
	КонецЕсли;
	
	Для к=1 По СтрДлина(СокрЛП(Код)) Цикл
		Если Сред(Код,к,1)="." Тогда
			Если СписокКодов.Количество()>=2 Тогда //добавляем дефис в код родителя
				//группа может быть как с дефисом на конце так и без, поэтому добавляем дефис и ищем, если не нашли - добавляем без дефиса
				//
				Если Не Справочники.ВидыРабот.НайтиПоРеквизиту("КодПоПрейскуранту",Лев(Код,к-1)+"-").Пустая() ТОгда				
					СписокКодов.Добавить(Лев(Код,к-1)+"-");
				Иначе
					СписокКодов.Добавить(Лев(Код,к-1));
				КонецЕсли;				
			Иначе				
				СписокКодов.Добавить(Лев(Код,к-1));
			КонецЕсли;			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат СписокКодов;
	
КонецФункции
//**********************************************************************************
Функция ПреобразоватьНомерПрейскуранта(Ном)
	
	Если СтрДлина(СокрЛП(Ном))<2 Тогда
		Ном="0"+Ном;
	КонецЕсли;
	
	Возврат Ном;
КонецФункции
//**********************************************************************************
Функция ВсеПусто(Стр)
	
	Возврат Не ЗначениеЗаполнено(Стр.Стоимость) и Не ЗначениеЗаполнено(Стр.НормаВремени) и Не ЗначениеЗаполнено(Стр.КолЧеловек) и Не ЗначениеЗаполнено(Стр.ЗаработнаяПлатаОсновная)
	и Не ЗначениеЗаполнено(Стр.ЗаработнаяПлатаДополнительная);
	
КонецФункции
//**********************************************************************************
Процедура ЗаписатьЦены() Экспорт
	
	СпрРаботыУслуги=Справочники.ВидыРабот;
	СведенияОВидеРабот=РегистрыСведений.СведенияОВидахРабот;
	
	Попытка 		
		
		НачатьТранзакцию();
		
		ГруппаПрейскурантов=СпрРаботыУслуги.НайтиПоНаименованию("ПРЕЙСКУРАНТЫ ОБЛГАЗА",Истина);
		
	    Если ГруппаПрейскурантов.Пустая() тогда
			НоваяГруппа=СпрРаботыУслуги.СоздатьГруппу();
			НоваяГруппа.КодПоПрейскуранту="000000000001";
			НоваяГруппа.Наименование="ПРЕЙСКУРАНТЫ ОБЛГАЗА";
			НоваяГруппа.Записать();
			ГруппаПрейскурантов=НоваяГруппа.Ссылка;	
		КонецЕсли;	

		ТекущийРодитель=ГруппаПрейскурантов;
		
		
		Для Каждого Стр Из Прейскурант Цикл
			
			Состояние("Обрабатывается строка "+Стр.НомерСтроки);
			
			СписокРодителей=РазложитьНаКоды(Стр.Код);
			
			Для каждого КодРодителя Из СписокРодителей Цикл
				СоздатьРодителя(КодРодителя.Значение,ТекущийРодитель);	
			КонецЦикла;	
			
			НайденныйЭлемент=Справочники.ВидыРабот.НайтиПоРеквизиту("КодПоПрейскуранту",Стр.Код);
			
			Если НайденныйЭлемент.Пустая() ТОгда
				Если (Прав(Стр.Код,1)="-") или (ВсеПусто(Стр)) ТОгда
					ЭлементПрейскуранта=Справочники.ВидыРабот.СоздатьГруппу();	
				Иначе
					ЭлементПрейскуранта=Справочники.ВидыРабот.СоздатьЭлемент();	
				КонецЕсли;		
				ЭлементПрейскуранта.КодПоПрейскуранту=Стр.Код;	
				ЭлементПрейскуранта.Родитель=ТекущийРодитель;
			Иначе
				ЭлементПрейскуранта=НайденныйЭлемент.ПолучитьОбъект();
			КонецЕсли;
			
			ЭлементПрейскуранта.Наименование=Стр.Наименование;					
			ЭлементПрейскуранта.Записать();
			
			//
			Если Не ЭлементПрейскуранта.ЭтоГруппа ТОгда
				
				НаборЗаписей=СведенияОВидеРабот.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Стр.ДатаС);
				НаборЗаписей.Отбор.ВидРаботы.Установить(ЭлементПрейскуранта.Ссылка);
				НаборЗаписей.Прочитать();				
				
				Если НаборЗаписей.Количество()=0 Тогда
					
					Сведения=НаборЗаписей.Добавить();
					Сведения.Период=Стр.ДатаС;
					Сведения.ВидРаботы=ЭлементПрейскуранта.Ссылка;
					
				Иначе
					
					Сведения=НаборЗаписей[0];
					
				КонецЕсли;					
				
				Сведения.СтоимостьПоПрейскуранту=Стр.Стоимость;
				Сведения.НормаВремени=Стр.НормаВремени;
				Сведения.КолЧеловек=Стр.КолЧеловек;
				Сведения.ЗаработнаяПлатаОсновная=Стр.ЗаработнаяПлатаОсновная;
				Сведения.ЗаработнаяПлатаДополнительная=Стр.ЗаработнаяПлатаДополнительная;
				НаборЗаписей.Записать();
				
			КонецЕсли;			
			//
					
		КонецЦикла; 
		ЗафиксироватьТранзакцию();
		Предупреждение("Загрузка цен успешно завершена!");
		
	Исключение
		ОтменитьТранзакцию();
		Сообщить(ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;	
	
КонецПроцедуры
//**********************************************************************************
